[
  "На Рython можно написать все. На C++ можно написать Python.",
  "Убраться на столе? Не, не слышал.",
  "Кому и командная строка – дружественный интерфейс...",
  "На С я могу просто делать ошибки. На С++ я могу их наследовать!",
  "Я сам раозбарл, поичтсил и сбоарл клаиуавтру.",
  "9 утра. — Уже работаешь? ... — Ещё работаю.",
  "Никто не называет автомобиль двигателем, но вот системный блок процессором...",
  "Работай! Ну пожалуйста...",
  "Дописал свою баговую прогу, все продебажил, работает идеально...но тут — проснулся.",
  "На ассемблере можно написать всё, что угодно. Но жизнь коротка.",
  "Я видел прекрасный мир, где программы компилируются с первого раза.",
  "Когда я устраивался на работу, мне сказали, чтобы я забыл всё, чему учился в универе. Ну я и забыл.",
  "Когда-нибудь мой сын покажет на иконку сохранения и спросит, почему она так выглядит. Что я ему скажу?",
  "Выучил английский, чтобы не менять раскладку.",
  "Видели ночь, кодили всю ночь до утра!",
  "Кто-то ищет вторую половинку. Я ищу ошибку в коде.",
  "Нужно создать видимость работы. Форматирую код вручную.",
  "Все работает. Оптимизировал. Не работает.",
  "Чтобы разобраться в чужом коде, нужен тот, кто его писал, и паяльник.",
  "— Папа, а кто-то ещё пишет на Паскале? — Нет, сын, это — фантастика.",
  "Закупился валерьянкой — пишу новую программку.",
  "Сломался пробел? Не беда. Alt+32.",
  "Посмотрел фильм \"Социальная сеть\". Вдохновленно сел писать код.",
  "Вот черт, я потерялся! В коде.",
  "Ошибка при определенном тесте? Решил проблему if-ом.",
  "Код Шредингера — это такой код, не запуская которого, нельзя сказать, есть ли он, или его надо весь удалить и написать новый.",
  "Админу стало скучно. Позвонил в тех. поддержку, сказал, что сломался интернет.",
  "Есть два вида вредоносных программ. 1) Вирусы. 2) Яндекс-бар.",
  "Не откладывай на завтра, если завтра сдача проекта. Хотя...",
  "Приснился кошмар. Microsoft Linux XP.",
  "Запели птички. Пора ложиться спать.",
  "Пустая кружка — единственное, что должно отрывать тебя от кодинга.",
  "Не пью, не курю, на ноль не делю.",
  "Решил для себя написать программку для быстрого определения своего IP. Ищу ошибку в тысячной строке.",
  "Любимый вид танца: с бубном.",
  "Искал идеальную девушку, написал ее сам.",
  "Первое правило уборки в квартире: убрать себя от компьютера.",
  "Успешная компиляция поднимает настроение.",
  "Как хорошо бы ты ни программировал, всё равно попросят переустановить Windows.",
  "Пришел на работу пораньше — провел все утро.",
  "Написал \"Hello, world\". Напишу и Windows 9.",
  "Нечем заняться... Переустановлю ОС!",
  "Нашел непонятный код в работающей программе. Закомментил.",
  "Неделю назад закодировался. Вчера подобрал код.",
  "Второе правило программиста: троллить простых смертных, которые задают глупые вопросы.",
  "Купил айфон и кило яблок. Пытаюсь их также откусить.",
  "В аду уже уготовано место для тех, кто путает программистов с сисадминами.",
  "Написал код — работает. Не нравятся имена переменных — поменял их... Код не работает!",
  "Те-ле-ви-зор?.. Не, не слышал.",
  "Бывших программистов не существует.",
  "Лень решать задачу по математике. Написал программу, которая ее решает.",
  "Глянул чужой код... Да лучше я напишу свой с нуля!",
  "В гардеробе выдали номерок 404. Стремно за куртку.",
  "Дебажил 6 часов. Понял, что баг в компиляторе.",
  "У меня пальцы пианиста. И мозг математика.",
  "Два телепата начали читать мысли друг друга одновременно... Умерли от переполнения стека.",
  "Написал сотни хороших программ. В голове.",
  "На клаве стерлись буквы C и V. Палево.",
  "Задал вопрос на российском форуме. Объяснили, какой я идиот.",
  "Ночью спать? Не, не пробовал...",
  "Думать или загуглить — вот в чем вопрос.",
  "Не все потеряно, пока пальцы над клавой и на экране строка...",
  "Не ошибается тот, кто ничего не кодит.",
  "Переустановка Windows — как разморозка холодильника. Помогает, но ненадолго.",
  "Есть два пути писать безошибочные программы. И только третий правильный.",
  "Программисты по натуре люди ленивые. Поэтому они собираются в стаи и ленятся сообща.",
  "Тоскую по тем временам, когда к ЭВМ допускали людей только с прямыми руками.",
  "Пришел в гости — почини компьютер.",
  "Рабочий код бесценен. Для всего остального есть MasterCard.",
  "Написал код. Пересмотрел его еще раз, чтобы понять, насколько я крут.",
  "Когда мне хочется экстрима, делю на калькуляторе на ноль.",
  "4 часа думал, как улучшить код. Испортил за 5 минут.",
  "Пришел в гости. Научил кота выключать комп.",
  "Стер комментарии, поменял форматирование. Как будто бы сам написал.",
  "Java-программисты после бурного корпоратива не убирают за собой.",
  "Хуже всего приходится программистам Microsoft. Им, в случае чего, и обругать-то некого.",
  "Кроме женщин и компьютеров, я люблю девушек и калькуляторы.",
  "Написал интуитивно код. Запустил. Работает. Теперь сижу, разбираюсь, как именно работает.",
  "День рождения AGE++;",
  "Я не лентяй! Я — программист.",
  "Сказали, что человек имеет свойство разговаривать. Объяснил, что это метод.",
  "И настал дедлайн, и живые позавидовали мертвым.",
  "Пришел переустанавливать Windows. Принесли зачем-то отвертку.",
  "Программист — это комбинация лени и логики.",
  "Сломался ноут перед отъездом. Дорога в никуда.",
  "Сделал две ошибки — получил нужный результат. Исправил одну — результат неверный.",
  "\"Плохая\" переменная отдаётся всем функциям подряд и разрешает делать с собой всё, что угодно.",
  "Как папку не назови, искать всё равно придется.",
  "Компилировал, перекомпилировал, да не выперекомпилировал.",
  "Минздрав предупреждает: программирование является причиной развития интеллекта и креативности мышления.",
  "Это странное чувство... Когда тебе не хочется кодить и тебя тянет на улицу.",
  "Не компилируй мне мозги!",
  "Завтра дедлайн. Хороший повод начать делать проект.",
  "Не везёт в любви, повезёт в С++.",
  "Я бы изменил мир, но Бог не дает исходников.",
  "Хотите разозлить программиста? Попросите у него, чтобы он научил вас делать игры.",
  "Завтра. Как же много в слове этом таится дней и ночей.",
  "Увидел чей-то код. Раскритиковал.",
  "Знакомая попросила переустановить Windows. Взял дистрибутив ubuntu.",
  "Подруга попросила починить компьютер. Починил.",
  "Сейчас придет девушка в гости. Убрался на рабочем столе.",
  "Люди делятся на два типа – первый – те, кто нумерует массивы с единицы, и первый – те, кто нумеруют с нуля.",
  "Дописал комментарий к коду - откомпилировал заново.",
  "Не воспринимаю всерьёз людей, которые моложе Windows 98.",
  "Бойся 228, если это число ошибок в коде.",
  "Спросил на форуме, что не так с кодом. Узнал много нового о себе.",
  "Пишу новую прогу. Пока компилирую старую.",
  "У программера есть два состояния: \"втупляю\" и \"поперло\".",
  "Если хочешь что-то сделать, сделай это сам.",
  "Неправильно указал тип переменной. 2 + 2 = 22",
  "На чем пишешь — звучит так же, как: где служил?",
  "Первыми словами моего сына будет: \"Hello, world!\"",
  "Что ещё может будоражить кровь так, как кодинг до четырёх утра.",
  "Ничто так не ограничивает полет мысли, как компилятор.",
  "Увидел в тетради дочери надпись \"Леша+Маша=Дружба\". Не выдержал, исправил на \"Дружба==Леша+Маша\".",
  "Учил детей читать. Побитово.",
  "— О, ты же шаришь в компах... — Нет, только не это!",
  "Из-за леса, из-за гор, к нам пришел Fatal Error.",
  "Сказали, что завтра проверка лицензии на компах. Поставил Ubuntu.",
  "Программист мудреет, когда понимает разницу между \"запустить программу\" и \"получить запускающуюся программу\".",
  "Сел кодить. Сделал билд. Ошибок нет. Странно.",
  "Чтобы отыскать баг, ты должен мыслить как баг.",
  "Я тоже мог бы рассказать тебе о сервере, но ты об этом лучше логи посмотри.",
  "В аду есть отдельный котёл для тех, кто называет системный блок процессором.",
  "0 программистов ругал сердитый шеф. Потом уволил одного, и стало их FF.",
  "Вероятность успешной компиляции с первого раза крайне мала.",
  "Ничего не делал 10 секунд. Нажал Ctrl+S.",
  "Если инженер — врач компьютера, то я, безусловно, психолог.",
  "Решил поработать. Но вдруг Хабрахабр сам открылся.",
  "Код работает с первого раза? Ищите ошибку в компиляторе.",
  "Ты думал это любовь. А ей просто надо было винду переустановить.",
  "Давайте утром встретимся... В 14.00 вас устроит?",
  "Сделал в жизни ошибку. Хотел исправить. Error opening file 'life.exe' for writing.",
  "Люди делятся на два типа \"shift+alt\" и \"ctrl+shift\".",
  "Думай, как баг. Действуй, как баг. И ты найдёшь баг!",
  "Во тьме ночной, при свете дня — ищу ошибку в коде я.",
  "Лег спать в 10 вечера! А вам слабо?",
  "Готовлю еду по алгоритму.",
  "У меня есть girlfriend. Сам написал на С++.",
  "Нельзя просто так взять и скомпилировать чужие исходники с первого раза.",
  "На математике решали номер 1024. Друзья не поняли, почему он юбилейный.",
  "Проспал дедлайн. Зато выспался.",
  "В високосном байте — девять бит.",
  "Приснился идеальный код. Проснулся и записал.",
  "Судя по отступам, Маяковский писал на Python.",
  "Клавиша \"с\". Будь проклят тот, кто додумался до этого...",
  "Уволился с работы. Наконец-то можно покодить от души.",
  "Начал писать программу. Объявил 10 переменных. Использовал одну.",
  "У меня нет решения. Но я восхищен красотой проблемы.",
  "Все работает. Переключил с debug на release. Твою же мать...",
  "Собрал ядро Линукс. Руки переползли на плечи.",
  "Перепутал Рождество с Хэллоуином. oct(31) = dec(25).",
  "Гонял прогу по тестам. Пытался найти хоть один работающий.",
  "Люди делятся на два типа: iostream и stdio.",
  "Удобный интерфейс? Главное, что работает.",
  "Если нацарапать гвоздиком что-нибудь на дискете, то прочесть с нее можно только то, что вы на ней нацарапали.",
  "Почему ты не пишешь код прямо сейчас?!",
  "Программирование — процесс творческий. А вдохновение приходит поздно вечером.",
  "А вы знали, что блок схемы нужны, чтобы писать по ним код, а не наоборот?!",
  "Пришел к девушке с цветами и шампанским — отказала. Стандартные драйверы не подошли.",
  "Чем больше весит ненужный файл, тем лучше.",
  "Попросили исправить чужой код. сtrl+A; delete; пишу программу.",
  "Что может быть красивее заката? \"Successful build\" на экране монитора.",
  "5 часов фиксил баг. Исправил одну строчку.",
  "Я ненавижу всё, что не работает. А то что работает, я пытаюсь улучшить и начинаю ненавидеть.",
  "Хакер — человек, способный наступить на грабли, даже если они спрятаны в сарай и заперты на замок. ",
  "Встал ночью, чтобы сходить в туалет. Просидел за компьютером до утра.",
  "Женская логика — это генератор случайных чисел.",
  "Расписываю ручку: \"Hello, world\".",
  "Сисадмин мнил себя Богом сети. Электрик грубо развеял этот факт.",
  "Ну вот допустим, у тебя есть 1000 $$. Давай для определенности округлим до 1024 $$...",
  "Программист вообще в курсе, что он математик?",
  "Выучил английский язык, придумывая имена переменных и функций.",
  "Долгое время считалось, что бит неделим. Но советские ученые...",
  "Звоню в поддержку. Говорю, что делать.",
  "Исправил в коде одну ошибку. Создал две новых.",
  "Сижу, работаю, чувствую запах жареной картошки... А ведь я ее варить ставил.",
  "Надоел вид за окном. Поменяю обои на рабочем столе.",
  "Python — это как Energizer, работает до 10 раз дольше.",
  "Скинь свой исходник. Мне просто сравнить...",
  "Все мы ходим по лезвию бритвы. Кто-то нюхает кокаин, кто-то убивает людей. Я же небезопасно извлекаю флешки.",
  "Взломал БД сайта, чтобы вспомнить свой пароль.",
  "Любимая каша — Perl'овая.",
  "Посеял ключи от квартиры. В голове крутятся мысли о Ctrl+F.",
  "Этот момент, когда на форуме написал название функции наполовину и ждёшь, когда IDE допишет её.",
  "Изучаешь ассемблер? Ты пал так низко!",
  "Тех. поддержка. Семь бед — один ответ.",
  "Увидел синий экран в телевизоре. По привычке перезапустил.",
  "О, ты программист? Глянешь компьютер? ... Будто я никогда не видел компьютеров.",
  "Закрыл диспетчер задач через диспетчер задач.",
  "Если двух программистов посадить за один компьютер, будет много шума.",
  "Исправлял один баг. Создал другой.",
  "Работать в главном потоке – это мейнстрим.",
  "Искал диск с виндой. Нашел паспорт, зачетку, читательский билет, деньги, еду.",
  "Написал 2000 строк кода без ошибок с первого раза. Проснулся.",
  "Как я стал программистом? Мне лень было учиться на другую профессию.",
  "Программирование как секс. Ошибешься — и нужно поддерживать всю жизнь.",
  "Вы пробовали выключить и снова включить?",
  "На вопрос: \"Можно ли это сделать?\" — Отвечаю да. А потом думаю, как.",
  "Не родился, а скомпилировался.",
  "Пошел в магазин. Купил ящик кофе и печенек.",
  "Идти спать?! — Да ну, лучше еще покодить... И так постоянно.",
  "Солнце село, свет погас. Время кодинга сейчас!",
  "Компилятор — не прощает ошибки.",
  "Настроил комп против людей!",
  "Набрал запрос в гугле быстрее, чем он подобрал популярные варианты. Fuck yeah.",
  "Самое трудное в программировании — это придумывать имена переменным.",
  "Sudo. Почувствуй себя всемогущим.",
  "Бывают моменты, когда единственное, что ты хочешь - это делить на ноль.",
  "Открываю IDE с исходным кодом, чтобы другие люди боялись трогать компьютер.",
  "Сяду в умную позу и нахмурю брови. Босс решит, что я думаю над проблемой.",
  "Грелся в ванной, нашёл ошибку в коде по памяти.",
  "Челябинские программисты настолько суровы, что кодят на печатной машинке.",
  "Настоящий программист — всегда голодный, потому что он забывает поесть.",
  "Когда мне хочется немного извращений, я начинаю делать вставки на ассемблере.",
  "Медленный компьютер — это когда ты знаешь имена всех разработчиков Adobe Photoshop.",
  "Написал строчку, запустил, не работает. Стер. Написал то же самое.",
  "Захотел что-то поменять в жизни - переустановил винду.",
  "Попался случай, где без goto действительно не обойтись. Дьявол в бешенстве.",
  "Запилил мега-функцию. Оказалось, велосипед.",
  "\"Это не наш метод\", — сказал один класс другому.",
  "Защищаю курсовую. Старательно обхожу баги.",
  "Будь первым. Пиши вирусы для Linux.",
  "Девушка сказала 100000 раз написать \"Прости\". for i:=1 to 100000 do writeln('Прости').",
  "Если мужчина согласился переустановить вам Windows, значит вы ему действительно нравитесь.",
  "Скомпилировал свою программу, появился Яндекс Бар.",
  "Настоящие программисты не боятся использовать goto.",
  "Стакан наполовину пуст или наполовину полон? Я бы сказал, что он в 2 раза больше, чем нужно.",
  "Этот волнительный момент, когда код написан правильно, но ничего не работает!",
  "У всех компиляторы как компиляторы, а мой — истеричка.",
  "14 февраля - день компьютерщика, а не Святого Валентина.",
  "На клавиатуре Чака Норриса только клавиши 0 и 1.",
  "Ночь, улица, фонарь, аптека... Звучит как постепенная загрузка текстур.",
  "Пытаешься понять, почему код не работает. На следующий день запускаешь — работает. Как?!",
  "Терпенье и true все перед root.",
  "Придумал гениальную идею. Загуглил, оказывается, такое уже есть...",
  "Тот момент, когда все должно работать, НО НЕ РАБОТАЕТ.",
  "int i = 5; i = ++i + ++i; Да я точно тебе говорю, 14.",
  "3k строчек кода. Баг, ну ты моргни хотя бы.",
  "Я не хочу печенек и кофе! Я хочу работать.",
  "Сын спросил: почему солнце восходит и заходит? Главное, что работает.",
  "Код работает с первого раза. Что-то не так...",
  "Друг рассказал, что микроволновка сломалась. Спросил, что пишет в логах.",
  "Да кто такой криворукий код писал?! Ааа, это же я, год назад...",
  "Начал решать проблему с помощью регулярных выражений. Теперь решаю две проблемы.",
  "Программисты на работе общаются двумя фразами: \"непонятно\" и \"вроде работает\".",
  "Очередь в магазине. Ну почему ты не стек?!",
  "Пишешь код во сне? Значит, скоро сдача проекта!",
  "На вопрос \"Что делаешь?\", шлю скрин диспетчера задач.",
  "Я твоя программа и я не хочу создавать файл, я хочу права администратора.",
  "Программист, ты стал совсем взрослым. У тебя уже растут руки.",
  "Переустановил ей Windows. Даже спасибо не дала.",
  "И я там был, wi-fi ловил. Сети находило, а доступа не давало.",
  "Отпуск — время переустановить ОС.",
  "Дали проект. Глаза делают, руки не хотят.",
  "Включил музыку. +10 к правильности кода.",
  "Зевнул перед зеркалом. Вызвал рекурсию.",
  "Программиста отличает способность найти выход из сложной ситуации. Также поражает умение найти туда вход...",
  "Сколько раз себе говорил: \"пришел домой — сначала покушай и только потом за комп\".",
  "— Ты чего не спишь? — Закодировался.",
  "Я залогинился взглянуть, не залогинилась ль она, чтоб посмотреть, не залогинился ли я.",
  "Чужой код. 2500 строк. Нет комментариев. Непонятные переменные и функции. Ошибки с памятью... Вызов принят!",
  "Сказал, что занимаюсь версткой. Подарили рубанок!",
  "Отлаженный код - хороший код.",
  "Кто сдал проект, тот в цирке не смеётся.",
  "Добавил несколько комментов. Лучше перекомпилю...",
  "Сделал неправильно. Скажу, что так и задумано.",
  "Слушаю музыку с кейгенов.",
  "Перед тем, как программировать, полгода подбирал язык программирования.",
  "По дороге домой — пишу код в уме.",
  "Я категоричен, как Boolean.",
  "Зашел на сайт. Нажал Ctrl+U.",
  "Мы писали, мы писали, наши пальчики устали. Мы немного отдохнем и опять писать начнем!",
  "Хороший программист проливает кофе на себя. И ноут цел, и бодрит в два раза лучше.",
  "Решил походить по собеседованиям. Понял, насколько мало я знаю.",
  "Поступил на программиста. 2 года думал, что учусь на профессора математики.",
  "Что такое индустриальное программирование? Сидят индусы и пишут триальные программы!",
  "Патриотичный цикл for(int c=0; c<10; c++)",
  "В комнате стало холодно. Запустил while(1); в четыре потока.",
  "Последняя строчка, и иду спать.",
  "У всех свои тараканы в голове, но у разработчиков они превращаются в программные баги.",
  "Я не хочу ничего решать! Я хочу ТЗ.",
  "Чудеса случаются. Это я вам как программист говорю.",
  "Смотрю сериалы про ЦРУ, чтобы поржать с их \"хакеров\".",
  "First words in my life? \"Hello, world!\"",
  "Не ложусь спать, пока не закончу. Потому что завтра уже ничего в коде не пойму.",
  "Пришел на свидание к девушке. Подарил букет из оптоволокна.",
  "Скоро останется два типа людей. Те, кто управляет компьютерами, и те, кем управляют компьютеры.",
  "В моей квартире не бардак, а POINT-AND-CLICK ADVENTURE.",
  "Отсутствие фантазии — это Project1 в Новой папке.",
  "Чтобы компенсировать растущую мощность компьютеров, программисты используют фреймворки.",
  "Самая большая ложь 21 века: я прочел и принимаю условия пользовательского соглашения.",
  "Красный свет на светофоре - это точка останова.",
  "Сколько пальцев на руке? 0, 1, 2, 3, 4... 4!",
  "Все мы ходим по лезвию бритвы. Кто-то нюхает кокаин, кто-то убивает людей. Я же не обнуляю переменные.",
  "Красные глаза \"по умолчанию\".",
  "Попросили написать программу на Basic. Написал и скинул на перфокарту.",
  "Занимаюсь сексом — в безопасном режиме.",
  "Любимые хэш-тэги программистов: #include и #define.",
  "Переустановил соседу винду. Теперь скрываюсь от других соседей.",
  "Поставили на электростанцию Android. Через день — разрядилась.",
  "Компилятор, не матерись! Объясни НОРМАЛЬНО.",
  "Телевизор?.. А он ещё существует???",
  "Решил покодить, пока греется суп? Плохая идея!",
  "Подруга написала: \"Привет)\". Ответил, что она забыла одну скобку.",
  "Девушка, как винда. Загрузишь — зависнет.",
  "Сметана — это драйвер для борща.",
  "Пора дефрагментировать квартиру.",
  "Два часа искал ошибку в коде и вдруг! случайно нашёл её! Что? И всё из-за этой хрени?",
  "Сколько программистов нужно, чтобы закрутить лампочку? Ни одного. Это аппаратная проблема. ",
  "Интересно, что бы Шерлок Холмс мог сказать о моем коде?",
  "Перенес рабочую функцию в новый проект. Не работает.",
  "Компилятор нашел ошибку. Закомментировал строку.",
  "Люблю петь в душе. На ассемблере.",
  "Кто рано встает, у того скоро дедлайн проекта.",
  "Причина багов — преждевременная компиляция.",
  "Написал код на бумажке. Отладил в голове.",
  "Среда разработки. Четверг отладки.",
  "Программист — самый трудолюбивый работник в фирме! До обеда и пашню засеял, и город построил, и воинов нанял!",
  "Что объединяет программиста и наркомана? Красные глаза.",
  "Кодим! До потери сознания!",
  "При компиляции держу пальцы крестиком.",
  "Программист говоришь? Контакт взломать сможешь?",
  "Написал вирус, чтобы протестировать антивирус.",
  "Не смог выиграть в логическую игру. Написал программу.",
  "Когда получаю новый проект, думаю не о процессе написания, а о сладком моменте финала!",
  "Не обдумывай код. Будь спонтанным.",
  "Сломал кнопку правого шрифта. Понял значение цитаты: \"Люди начинают ценить только тогда, когда теряют\".",
  "К Н Ш М Ы. Доктор, у вас неправильная кодировка.",
  "Есть две вещи, которым программист учится всю жизнь. Читать и писать.",
  "Отсортировал массив. Надо написать об этом в своем \"блоге программиста\".",
  "Вы что, читать не умеете?! Тут же #000000 по #FFFFFF написано.",
  "People always ask me why my keyboard is so loud. Don't they know that C++ is strongly typed.",
  "Заработался. Перепутал 3 этаж с 11.",
  "Захотел поиграть в тетрис. Написал его.",
  "Вся жизнь — программа. А люди в ней – локальные переменные.",
  "Покажи свой код, и я скажу кто ты.",
  "Как ты смог это реализовать? — Мне приснилось.",
  "Температура в комнате, какая бы она ни была — всегда комнатная.",
  "Лучшая защита от SQL инъекций — отсутствие базы данных.",
  "Идеального кода не существует, так как нет предела совершенству!",
  "Я настолько ленив, что сразу пишу рабочий код.",
  "Чайник показал код и спросил, где у него ошибка. Ответил, что в ДНК.",
  "Я работаю, когда отдыхаю. И отдыхаю, когда работаю.",
  "Семь бед — один reset.",
  "От меня боятся принимать .exe файлы.",
  "Увидел на часах 10:24. Загадал желание.",
  "Лень кодить нудную фичу. Убедил заказчика, что она не нужна.",
  "Пока придумывал имя переменной, забыл, для чего она мне нужна.",
  "Накодил? Убери за собой!",
  "Windows для чайников. Это не книга — это утверждение.",
  "Написал прогу. Не работает. Все стер, написал заново. Заработало.",
  "Решил убраться на рабочем столе, создал папку и сгреб все туда.",
  "Написал прогу — не работает. Написал систему под эту прогу — все отлично.",
  "Битва IT-экстрасенсов. Лучшие админы проникают в головы юзеров и угадывают, что они нажали и почему \"ничего не работает\".",
  "9:00 — пришел на работу. 13:40 — запустил IDE.",
  "Пока засыпал, полностью обдумал код. Проснулся – забыл.",
  "Свой код — потёмки. Чужой — лес непроходимый.",
  "Паблик морозов. Класс-потомок, выдающий по запросу все данные класса-предка, независимо от степени их сокрытия. ",
  "Нет повести печальнее на свете, чем повесть об упавшем интернете.",
  "Закончил проект! Заказчик сменил ТЗ...",
  "Красивый загар, где отдыхал? Отдыхал? Это от монитора.",
  "Только ненаписанный код не содержит ошибок.",
  "Не уверен, что стоит заниматься просьбой босса. Лучше исправлю прогу.",
  "Шум от кулера, как колыбельная.",
  "Не комментируй код. Будь плохим парнем.",
  "Нажимаю \"Выборочная установка\". Далее, далее, далее.",
  "Программист — это профессиональный конвертёр галлюцинаций заказчика в жёсткую формальную систему.",
  "#define private public. Показать все, что скрыто.",
  "А+=++А+++++А++; Java-программисты смеются над вами.",
  "Программист не знает усталости!",
  "Самое большое заблуждение: \"Встану-ка я завтра пораньше и всё доделаю\".",
  "Дорогой, сходи, купи пакет молока и, если будут яйца, купи 6. Купил 6 пакетов молока, яйца были.",
  "Чихнул в перечницу — вызвал рекурсию.",
  "Чак Норрис не получает ошибки компилятора. Компилятор сам подстраивается под Чака.",
  "Функция \"свободная касса\" превращает половину очереди в стек.",
  "Не нашел диск с драйверами — написал сам.",
  "Дети – это наше будущее! И роботы. Дети и роботы.",
  "Конечно, дорогая, ты для меня дороже компьютера.",
  "Как-то раз я скомпилировал программу с первого раза без ошибок. Но появилась надпись: \"Тебе всё равно никто не поверит\".",
  "Решаем проблемы, неизвестные никому, способами, которые никто не знает.",
  "Знакомые гуманитарии узнали, что я программист. Достали шутками про 0 и 1.",
  "Дописал строку. Нажал Ctrl+S.",
  "Я верю в компиляцию с первого раза.",
  "Настает ночь. Город начинает кодить.",
  "Романтический ужин при свичах в компании соблазнительных цисок.",
  "Завожу переменную \"С\". Чтобы в коде писать С++.",
  "В моих программах нет багов. Есть лишь неожиданные фичи.",
  "Все мы расплачиваемся за первородный грех. Изучение Basic в особо впечатлительном возрасте.",
  "Я верю только в три вещи: инкапсуляцию, полиморфизм и наследование.",
  "Чем программист отличается от Бога: Бог не считает себя программистом.",
  "Израильский SQL-сервер. Отвечает запросом на запрос.",
  "В универе ходил только на программирование.",
  "Сынок, хватит сидеть за компьютером. Я программирую, мам!",
  "Завел кошку, еще не придумал, как назвать. Пока обращаюсь к ней по айпишнику.",
  "Увидел свой код полугодовой давности. Чуть не помер со стыда.",
  "Хороший программист должен с легкостью программировать на всем, на чем можно. И с небольшим трудом на том, на чем, казалось бы, нельзя.",
  "Ничто так не возбуждает дам, как разработка компьютерных программ.",
  "Познакомился с девушкой. Попросил IP.",
  "Идеальный интерфейс — это когда мама понимает.",
  "Почистил дорожку от снега. Повысил пропускную способность.",
  "Не поставил запятую — положил сервак.",
  "Я знаю 9 операционных систем. И ни одной женщины.",
  "Удалил корзину в корзину.",
  "У программиста было 2 сына: Антон и Неантон.",
  "Сломался комп. Ем на кухне.",
  "Пошел в туалет с ноутом. Вышел через три часа.",
  "— А зачем ты сохраняешься в ворде перед печатью? — Привычка.",
  "Звоню в поддержку провайдера — послушать музыку.",
  "Не говори \"гоп\", пока не скомпилируешь.",
  "Болтовня ничего не стоит. Покажите мне код.",
  "Ну что непонятного? Я же русским языком сказал: баг пофиксил, проапдейтил продакшен.",
  "Самый сложный язык программирования — это первый.",
  "Не понравился шрифт на сайте. Взломал. Изменил. Прочитал, что хотел.",
  "Непонимание того, как работает код, не освобождает вас от последствий его работы.",
  "Судя по количеству обновлений Firefox и Flashplayer, их пишет Дарья Донцова.",
  "Real programmers don't document if it was hard to write, it should be hard to read.",
  "Коктейль «Рекурсивный»: 20 % спирта, 30 % воды, 50 % коктейля «Рекурсивный».",
  "А еще, чтобы от нас отстали, мы говорим обычно так: наши инженеры работают над решением вашей проблемы.",
  "Программисты не рождаются. Программисты наследуются.",
  "Я не страдаю бессонницей. Я ей владею.",
  "Чтобы искать в гугле, жена сперва ищет гугл в яндексе.",
  "Салат Фибоначчи. Составлен из вчерашнего и позавчерашнего салатов.",
  "Проснулся. Оказалось, не спал.",
  "Хороший программист характеризуется умением доказать, почему задачу невозможно выполнить, когда ему просто лень её выполнять.",
  "Жизнь — игра. Сюжет — так себе, но графика потрясающая.",
  "— Сейчас, у меня друг программист. — Алло, Саш? Тут у моей подруги фен сломался...",
  "Life's too short to remove USB safely.",
  "Я не помню, почему написал это таким кривым образом, но на это точно была причина.",
  "Нет пива? Нет сисадмина!",
  "Никого работа программы не удивляет так часто, как ее создателя.",
  "Тестирование. Время разочарований.",
  "Программирование — это игра слов.",
  "У каждого программиста есть инстинкт автосохранения.",
  "Разгруппировал файлы в папке \"мусор\" по типу файлов. Стало почище.",
  "Начинающий программист уверен, что в 1 килобайте 1000 байт. Законченный программист уверен, что в 1 километре 1024 метра.",
  "Меня трудно найти, легко потерять и невозможно забыть. Да я же рабочий исходник!",
  "Если в первый раз не вышло, назови это версией 1.0",
  "Мне кажется, начальник на меня смотрит и думает: \"Это устройство может работать быстрее\".",
  "Один терапевт — это 1024 гигапевта, или 1048576 мегапевтов.",
  "Рано или поздно люди взрослеют и переходят на Linux.",
  "Не работает часть кода? Изменил название переменных, заработало!",
  "Я просто хотел написать игру. И тут понеслась.",
  "Программист — это не тот, кто пишет программы, а тот, чьи программы работают.",
  "Нашим детям будет сложно. Все логины будут заняты.",
  "Поставил убунту. Теперь говорю всем, что не разбираюсь в винде.",
  "Люди, как пиратская версия винды. Вроде ось одна, а баги у всех разные.",
  "if (x==true) & (x==false) then x=schrodinger endif",
  "Хотел объяснить как это сделать. Сделал сам.",
  "Первое правило программиста: не дай понять компьютеру, что ты торопишься.",
  "Переустановил винду за спасибо.",
  "Работает? Не ожидал.",
  "Нормализовал базу, правильно применил паттерны, придумал быстрый алгоритм, оптимизировал его код... Эх, мечты, мечты.",
  "С наступающим Новым Кодом!",
  "Каждый программист в своей жизни обязан написать калькулятор.",
  "Чтобы запомнить телефон, я вычисляю контрольную сумму.",
  "Работать надо не 12 часов, а головой.",
  "Высыпаюсь, пока включается компьютер.",
  "Задачу поставили другому программисту... Это элементарно!",
  "Выучил английский очень быстро. Он очень похож на С++.",
  "Программист — это не профессия. Программист — это образ жизни.",
  "Не нашел ошибку в своем коде за час. Ошибка компилятора!",
  "137 сообщений об ошибках. Забыл точку с запятой.",
  "Первый этап разработки программы — борьба с ленью.",
  "В магазине попросили передать пакет. Спросил IP адрес.",
  "Написал программу. //В комментариях еще 3.",
  "Нельзя так просто взять и уйти с работы в 6.",
  "Рассказал другу шутку. Полчаса объяснял термины.",
  "Не нашёл нужной программы в интернете. Написал сам.",
  "99 % ошибок компьютера сидят в полуметре от монитора.",
  "No Windows. No problems.",
  "Код - это поэзия.",
  "Жена сказала, что мы мало общаемся. Купил ей компьютер и соединил с моим.",
  "В Гарри Поттере в газетах печатают гифки.",
  "Ушел пораньше с работы, чтобы поработать дома.",
  "При попытке поработать был обнаружен интернет.",
  "Каждый раз, когда ты пишешь long вместо byte, кто-то бежит докупать планки оперативки.",
  "Попросили установить \"какой-нибудь антивирус\". Поставил Linux!",
  "Мои дети постоянно ссорятся. Конфликт версий.",
  "Мышечная память — это когда страница еще не загрузилась, а ты уже поставил мышку на то место, куда надо кликнуть."
]